# завдання 1 
def Dovgota_str(ved):
    # Якщо довжина рядка менша за 2, вивести повідомлення
    if len(ved) < 2:
        print("Рядок за короткий")
        return ""
    # В іншому випадку, беремо перші 2 та останні 2 символи
    return ved[:2] + ved[-2:]

# Тестування програми
ved = input("Введіть рядок: ")
print(Dovgota_str(ved))


# завдання 2

# Отримуємо введення від користувача
phone_number = input("Введіть телефонний номер: ")


# Перевірка, чи рядок містить лише цифри і має довжину не більше 10
if len(phone_number) <= 10 and phone_number.isdigit():
    print("Телефонний номер має правильний формат.")
else:
    print("Невірний формат телефонного номера. Він має містити лише цифри і бути не довшим за 10 символів.")



# завдання 3


vuraz = "5 + 3 * 2"
pravul = 5 + 3 * 2  # Оскільки ми працюємо з виразом, можемо безпосередньо порахувати правильну відповідь

# Запитуємо користувача про відповідь
vidpov = input(f"Яка відповідь на вираз {vuraz}? ")

# Перевірка, чи ввів користувач правильну відповідь
try:
    vidpov = int(vidpov)  # Пробуємо перетворити введену відповідь в ціле число
    if vidpov == pravul:
        print("Правильно! Ви відповіли вірно.")
    else:
        print(f"Невірно. Правильна відповідь: {pravul}")
except ValueError:
    print("Будь ласка, введіть числову відповідь.")

# завдання 4

# Збереження ім'я у нижньому регістрі
saved_name = "Serhiy"
    
# Запитуємо ім'я користувача
user_input = input("Введіть своє ім'я: ")
    
# Перевірка, чи введене ім'я дорівнює збереженому, без урахування регістру
if user_input.strip().lower() == saved_name:
    print(True)
else:
    print(False)